# 주석 
# 파이썬에서는 #을 붙여서 나타냄
# vscode 단축키 ctrl + /

print("1 + 2 = ", 1 + 2) # 1 + 2 의 결과를 출력
print("1 - 2 = ", 1 - 2) # 1 - 2 의 결과를 출력
print("1 * 2 = ", 1 * 2) # 1 * 2 의 결과를 출력
print("1 / 2 = ", 1 / 2) # 1 / 2 의 결과를 출력
print("2 ** 3 = ", 2 ** 3) # 2의 제곱의 결과를 출력. ** 두개는 제곱
print("3 / 2 = ", 3 / 2) # 나눗셈
print("3 // 2 = ", 3 // 2) # 몫 연산자
print("3 % 2 = ", 3 % 2) # 나머지 연산자

# python 연산자
# + 더하기 연산자 
# - 빼기 연산자
# * 곱하기 연산자
# / 나누기 연산자 
# ** 제곱 연산자
# // 정수 나누기(몫) 연산자
# % 나머지 연산자

print("안녕하세요")
print('반갑습니다')
print('여려분')
print("그는 생각했다.'생강생강'")
print('그녀는 말했다."말말"')
print("쌍따음표 사용하기 \"")

# 이스케이프 문자
# \n 줄바꿈
# \t 탭
# \" 쌍따음표
# \' 따음표
print('n') # n을 그냥 출력함
print('\n') # 줄바꿈이 실행됨
print('n\n\tt')

print('''안녕하세요
반갑습니다
잘부탁드립니다
안녕히계세요''') # 쌍따음표 or 따음표 3개로 간단하게 줄바꿈이 가능함
